Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཁྱོད་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རྣམས་ ཀྱི་ དོན་ དང་ །_ ལྷག་པ འི་ བསམ་པ་ ལ་ ཡང་དག་ པར་ ཞུགས་པ་ ཡོན་ཏན་ གྱི་ སྤྱོད་པ་ ལ་ རབ་ཏུ་ གནས་པ །_ བཟོད་པ་ དང་ དེས་པ་ ལ་ རབ་ཏུ་ གནས་པ་ རྣམས་ ཀྱི་ དོན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ལ་ འདྲི་བ་ ནི་ ཁྱོད་ ཡང་ ལེགས་ སོ །_།
en: Śāradvatī­putra, you have done well to request the Thus-Gone, worthy, perfectly awakened Buddha on behalf of the bodhisattva great beings, and on behalf of those who have embraced the altruistic intention and practice wholesome conduct, patience, and gentleness!

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཡོན་ཏན་ རྣམས་ ཀྱི་ མཐའ་ ནི་ རྟོགས་པ ར་ མི་ ནུས་ སོ །_།
en: $1097 “Śāradvatī­putra, the limit of qualities cannot be fathomed.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཅི་འདྲ་བ འི་ སེམས་ཅན་ དེ་དག་ གི་ དོན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ ལ་ ཁྱོད་ འདྲི་ [132a] བ་ ནི་ སེམས་ཅན་ དེ་དག་ ནི་ དེ་ཙམ་ དུ་ དཀའ་བ་ བྱེད་པ་ ཡིན་ ཏེ །_
en: Śāradvatī­putra, the beings on whose behalf you ask the Thus-Gone One questions perform only limited hardships. [132.a]

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འདི་ལྟ་སྟེ་ དཔེར་ན་ མི་ལ་ ལ་ ཞིག་ གིས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ན་ སེམས་ཅན་ གང་ སུ་ དག་ ཇི་སྙེད་ ཡོད་པ་ དེ་དག་ ཡིད་ ལ་ བྱེད་པ་ གཅིག་པ ར་ བྱས་ ན
en: For instance, Śāradvatī­putra, suppose someone were to bring to mind all the beings that exist throughout the trichiliocosm.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འདི་ ཇི་སྙམ་ དུ་ སེམས །_ འོ་ན་ མི་ དེས་ དཀའ་བ་ བྱས་པ་ ཡིན་ ནམ །_
en: What do you think, Śāradvatī­putra, would that person have performed a difficult task?”

source: བཅོམ་ལྡན་འདས་ དཀའ་བ་ བགྱིས་པ་ ལགས་སོ །_།
en: “Indeed, Blessed One, that person would have performed a difficult task.”

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དཀའ་བ་ འདི་ ནི་ བྱང་ཆུབ་ སེམས་དཔ འི་ དཀའ་བ་ སྔ་མ་ ལ་ བརྒྱ འི་ ཆར་ ཡང་ ཉེ་བ ར་ མི་ འགྲོ འོ །_།
en: $1098 “Śāradvatī­putra, the difficulty of that former task does not approach even one hundredth of the difficulties of a bodhisattva’s task.

source: སྟོང་ གི་ ཆ་ དང་ །_ འབུམ་ གྱི་ ཆར་ ཡང་ ཉེ་བ ར་ མི་ འགྲོ་བ་ ནས་ རྒྱུ འི་ བར་ དུ་ ཡང་ མི་ བཟོད་ དོ །_།
en: It does not approach even one thousandth, or one hundred thousandth of a fraction of that difficulty—there can be no comparison.

source: སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཚ་བ་ འབར་བ་ རབ་ཏུ་ འབར་བ་ ཀུན་ ཏུ་ རབ་ཏུ་ འབར་བ །_ ཀུན་ ཏུ་ མེ་ལྕེ ར་ གྱུར་པ་ འདི་ ནི་ མེ འི་ ཕུང་པོ་ དེ་ མི་ལ་ ལ་ ཞིག་ གིས་ ཁ འི་ དབུགས་ ཀྱིས་ ཞི་བ ར་ བྱས་ ལ །_
en: suppose the trichiliocosm were to become completely engulfed in flames—flaring, burning, and blazing—and someone were to extinguish that fire with one breath, and then [with another breath, protect the Cakravāḍa and Mahācakravāḍa mountain ranges, the great king of mountains Sumeru, and other giant mountains;]

source: ཁ འི་ དབུགས་ ཅིག་ཤོས་ ཀྱིས་ ཁོར་ཡུག་ དང་ ཁོར་ཡུག་ ཆེན་པོ འི་ རི་ དག་ དང་ །_ རི འི་ རྒྱལ་པོ་ ཆེན་པོ་ རི་རབ་ དང་ །_ རི་ ཆེན་པོ་ གཞན་དག་ ཀྱང་ ཀུན་ ཏུ་ གནས་པ ར་ བྱས་ ཤིང་ །_ རྒྱ་མཚོ་ ཆེན་པོ་ དང་ །_ གླིང་ རྣམས་ དང་ །_ གཞལ་མེད་ ཁང་ དག་ དང་ །_ ཀུན་དགའ་ར་བ་ ཉམས་ དགའ་བ་ དག་ དང་ །_ ནགས་ཚལ་ ཉམས་ དགའ་བ་ དག་ དང་ །_ ཆུ་བོ་ ཉམས་ དགའ་བ་ དག་ དང་ །_ རྫིང་ ཉམས་ དགའ་བ་ དག་ དང་ །_ གྲོང་ དག་ གམ་ གྲོང་རྡལ་ དག་ གམ །_ ལྗོངས་ དག་ གམ་ ལྗོངས་ ཀྱི་ ཕྱོགས་ དག་ ཀུན་ དུ་ གནས་པ ར་ བྱས །_ |#| སོ་ སོ ར་ གནས་པ ར་ བྱས་ ན །_
en: [suppose the trichiliocosm were to become completely engulfed in flames—flaring, burning, and blazing—and someone were to extinguish that fire with one breath, and then ]with another breath, protect the Cakravāḍa and Mahācakravāḍa mountain ranges, the great king of mountains Sumeru, and other giant mountains; |#| the oceans, continents, and palaces, along with all the delightful gardens, parks, forests, rivers, and pools; |#| and all the towns, cities, counties, and regions.

source: མི་ དེས་ དཀའ་བ་ བྱས་པ་ ཡིན་ ནམ །_
en: Would that person have performed a difficult task?”

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དཀའ་བ་ འདི ས་ ནི་ བྱང་ཆུབ་ སེམས་དཔ འི་ དཀའ་བ་ སྔ་མ་ ལ་ བརྒྱ འི་ ཆར་ ཡང་ ཉེ་བ ར་ མི་ འགྲོ འོ །_།
en: $1100 “Śāradvatī­putra, the difficulty of that former task does not approach even one hundredth of the difficulties of a bodhisattva’s task.

source: སྟོང་ གི་ ཆ་ དང་ །_ འབུམ་ གྱི་ ཆ་ དང་ །_ གྲངས་ དང་ །_ ཆ་ དང་ །_ བགྲང་བ་ དང་ །_ དཔེ་ དང་ །_ རྒྱུ ར་ ཡང་ མི་ བཟོད་ དོ །_།
en: It does not match even one thousandth or one hundred thousandth of the former—no number, fraction, enumeration, analogy, or comparison would suffice.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འདི་ལྟ་སྟེ །_ |#| དཔེར་ན་ མི་ལ་ ལ་ ཞིག་ གིས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ བཤིགས་ ཤིང་ [132b] རྣམ་པར་ གཏོར་ ལ་ རྣམ་པར་ བཤིག་ པར་ གྱུར་ ན །_
en: $1101 “As another instance, Śāradvatī­putra, suppose someone were to shatter, scatter, and destroy the trichiliocosm. [132.b]

source: མི་ དེ་ བརྩོན་འགྲུས་ དང་ ལྡན་པ་ ཡིན་ ནམ །_
en: Would such a person be diligent?”

source: མི་ དེ་ ནི་ བརྩོན་འགྲུས་ མཆོག་ དང་ ལྡན་པ་ ལགས་སོ །_།
en: such a person would have supreme diligence.”

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བརྩོན་འགྲུས་ འདི ས་ ནི་ བྱང་ཆུབ་ སེམས་དཔ འི་ བརྩོན་འགྲུས་ སྔ་མ་ ལ་ བརྒྱ འི་ ཆར་ ཡང་ ཉེ་བ ར་ མི་ འགྲོ་བ་ ནས །_ |#| རྒྱུ འི་ བར་ དུ་ ཡང་ མི་ བཟོད་ དོ །_།
en: “Śāradvatī­putra, that first diligence does not approach even a hundredth of the diligence of a bodhisattva—no comparison would suffice.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འདི་ལྟ་སྟེ །_ |#| དཔེར་ན །_
en: $1102 “As another instance, Śāradvatī­putra,

source: མི་ལ་ ལ་ ཞིག་ གིས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ གང་ ན །_ |#| ཆུ འི་ ཕུང་པོ་ རབ་ཏུ་ གནས་པ འི་ ཆུ འི་ ཕུང་པོ འི་ གནས་ ཀྱི་ བར་ དུ་ དེ་ ཐམས་ཅད་ ཕྲག་པ་ ལ་ ཐོགས་ ཏེ །_ |#| སྦྲང་བུ་ མཆུ་རིངས་ ཀྱི་ རྗེ་ངར་ གྱི་ སྐས་ ལ་ ཚངས་པ འི་ འཇིག་རྟེན་ གྱི་ བར་ དུ་ འཛེགས་ ལ་ ལྷུང་བ ར་ ཡང་ མ་ གྱུར་ ན །_
en: suppose someone were to climb, without falling, all the way up to the world of Brahmā, on a ladder made of the legs of mosquitoes, carrying on their shoulders as much water as could fill the trichiliocosm.

source: མི་ དེས་ དཀའ་བ་ བྱས་ པ་ ཡིན་ ནམ །_
en: Would that person have performed a difficult task?”

source: བདེ་བ ར་ གཤེགས་པ་ ཤིན་ཏུ་ དཀའ་བ་ བགྱིས་པ་ ལགས་ ཏེ །_ |#| མི་ དེ་ བརྩོན་འགྲུས་ དང་ མཐུ་ཆེན་པོ་ དང་ ལྡན་པ་ ལགས་སོ །_།
en: that person would have diligence and great prowess.”

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཁྱོད་ མོས་པ ར་ བྱ འོ །_། |#| ཤ་ར་དྭ་ ཏི འི་ བུ་ ཁྱོད་ ཁོང་ དུ་ ཆུད་པ ར་ བྱ་ སྟེ །_
en: $1103 “Śāradvatī­putra, you should trust and comprehend that

source: སྟོབས་ དང་ །_ བརྩོན་འགྲུས་ དང་ ཐབས་ ལ་ མཁས་པ་ འདི ས་ ནི་ བྱང་ཆུབ་ སེམས་དཔ འི་ སྟོབས་ དང་ །_ བརྩོན་འགྲུས་ དང་ །_ ཐབས་མཁས་པ་ སྔ་མ་ ལ་ བརྒྱ འི་ ཆར་ ཡང་ ཉེ་བ ར་ མི་ འགྲོ འོ །_།
en: this former strength, diligence, and skill in means would not approach so much as a hundredth of the strength, diligence, and skill in means of a bodhisattva.

source: སྟོང་ གི་ ཆ་ དང་ །_ འབུམ་ གྱི་ ཆ་ དང་ །_ གྲངས་ དང་ །_ ཆ་ དང་ །_ བགྲང་བ་ དང་ །_ དཔེ་ དང་ །_ རྒྱུ ར་ ཡང་ མི་ བཟོད་ དོ །།_།།
en: It does not match even one thousandth or one hundred thousandth of a portion, and no number, fraction, enumeration, analogy, or comparison would suffice.

source: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན །_ |#| ཤ་ར་དྭ་ཏི འི་ བུ་ སྐྱེས་བུ་ དམ་པ་ དེ་དག་ ནི་ སེམས་ ཀྱི་ བརྩོན་འགྲུས་ དང་ །_ ལུས་ ཀྱི་ བརྩོན་འགྲུས་ དང་ །_ ལུས་ ཀྱི་ མཐུ་ དེ་ལྟ་ བུ་ དང་ ལྡན་པ །_ ཐབས་ ལ་ མཁས་ པ་ དེ་ལྟ་ བུ་ དང་ ལྡན་པ །_ སྨོན་ལམ་ དག་ དང་ ལྡན་པ །_ མཐུ་ དང་ ལྡན་པ་ ཡིན །_
en: This is because, Śāradvatī­putra, those sublime beings, endowed with such mental diligence, physical diligence, physical prowess, and skill in means, are equipped with aspirations and power.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་དག་ ནི་ ཤེས་པ་ དེ་ལྟ་ བུ་ ལ་ རབ་ཏུ་ གནས་པ །_ ཐེག་པ་ ཆེན་པོ་ དང་ །_ མི་ འཇིགས་པ་ ཆེན་པོ་ ལ་ རབ་ཏུ་ གནས་པ །_ མིག་ ཆེན་པོ་ ལ་ རབ་ཏུ་ གནས་པ །_ སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ ལ་ རབ་ཏུ་ [133a] གནས་པ །_ སྙིང་རྗེ་ ཆེན་པོ་ ལ་ རབ་ཏུ་ གནས་པ་ ཡིན །_
en: Śāradvatī­putra, committed to such knowledge, they are committed to the Great Vehicle, great fearlessness, great vision, buddha wisdom, and great compassion. [133.a]

source: དེ་དག་ ནི་ སྤྱོད་ལམ་ དང་ སྤྱོད་པ་ དེ་ལྟ་ བུ་ དང་ ལྡན་པ །_ ཡོན་ཏན་ གྱི་ སྤྱོད་པ་ དང་ །_ ངེས་པ་ ལ་ གནས་པ་ ཡིན །_
en: Being endowed with such comportment and conduct, they are committed to the practice and ascertainment of qualities.

source: དེ་དག་ ནི་ སྦྱིན་པ་ མངོན་པར་ སྒྲུབ་པ་ དང་ །_ ཚུལ་ཁྲིམས་ མངོན་པར་ སྒྲུབ་པ་ དང་ །_ བཟོད་པ་ མངོན་པར་ སྒྲུབ་པ་ དང་ །_ བརྩོན་འགྲུས་ མངོན་པར་ སྒྲུབ་པ་ དང་ །_ ཏིང་ངེ་འཛིན་ མངོན་པར་ སྒྲུབ་པ་ དང་ །_ ཤེས་རབ་ མངོན་པར་ སྒྲུབ་པ་ དེ་ལྟ་ བུ་ ལ་ རབ་ཏུ་ གནས་པ །_
en: $1104 “They are committed to the accomplishment of generosity, discipline, patience, diligence, absorption, and insight.

source: ཐབས་མཁས་པ་ མངོན་པར་ སྒྲུབ་པ་ ལ་ རབ་ཏུ་ གནས་པ །_
en: They are committed to the accomplishment of skill in means.

source: མཚན་ མངོན་པར་ སྒྲུབ་པ་ ལ་ མངོན་དུ་ ཞུགས་པ །_ སངས་རྒྱས་ ཀྱི་ རྣམ་པར་ འཕྲུལ་པ་ མངོན་པར་ སྒྲུབ་པ་ ལ་ མངོན་དུ་ ཞུགས་པ །_ ཁྱུ་མཆོག་ ཏུ་ གྱུར་པ་ མཐའ་ཡས་པ་ མངོན་པར་ སྒྲུབ་པ་ ལ་ མངོན་དུ་ ཞུགས་པ །_ སངས་རྒྱས་ ཀྱི་ ཆོ་འཕྲུལ་ མངོན་པར་ སྒྲུབ་པ་ ལ་ མངོན་དུ་ ཞུགས་པ །_ ཆོས་ ཀྱི་ སྦྱིན་པ་ མངོན་པར་ སྒྲུབ་པ་ ལ་ མངོན་དུ་ ཞུགས་པ །_
en: They are immersed in the accomplishment of awakened attributes, buddha manifestations, infinite supreme guides, awakened supernatural powers, and gifts of Dharma.

source: སེམས་ཅན་ གྱི་ བསམ་པ་ མངོན་པར་ སྒྲུབ་པ་ མཁས་པ་ ལ་ མངོན་དུ་ ཞུགས་པ །_ སེམས་ཅན་ རྣམས་ ཀྱི་ སྤྱོད་པ་ མངོན་པར་ སྒྲུབ་པ་ མཁས་པ་ ལ་ མངོན་དུ་ ཞུགས་པ །_
en: They are immersed in the skilled accomplishment of the wishes of beings and the conduct of beings.

source: སེམས་ཅན་ རྣམས་ ཀྱི་ སེམས་ ཚར་གཅོད་པ འི་ ཕྱིར་ མངོན་དུ་ ཞུགས་པ །_ སེམས་ཅན་ རྣམས་ ཀྱི་ སེམས་ ཚར་ གཅད་པ འི་ ཕྱིར་ རབ་ཏུ་ གནས་པ །_
en: They are intent upon and committed to the subjugation of beings’ minds.

source: སེམས་ཅན་ རྣམས་ ཀྱི་ སེམས་ ཀྱི་ མཚམས་ སྦྱོར་བ་ མངོན་པར་ སྒྲུབ་པ་ ལ་ མངོན་དུ་ ཞུགས་པ །_
en: They are immersed in the accomplishment of connecting with beings’ minds.

source: སེམས་ཅན་ ལ་ དམིགས་པ་ མངོན་པར་ སྒྲུབ་པ་ ལ་ མངོན་དུ་ ཞུགས་པ །_
en: They are immersed in the accomplishment of the perception of beings.

source: སེམས་ཅན་ རྣམས་ ཀྱི་ ཚུལ་ཁྲིམས་ མངོན་པར་ སྒྲུབ་པ་ ལ་ མངོན་ དུ་ ཞུགས་པ །_ སེམས་ཅན་ རྣམས་ ཀྱི་ ཏིང་ངེ་འཛིན་ སྒྲུབ་པ་ ལ་ མངོན་དུ་ ཞུགས་པ །_ སེམས་ཅན་ རྣམས་ ཀྱི་ རྣམ་པར་ གྲོལ་བ་ སྒྲུབ་པ་ ལ་ མངོན་དུ་ ཞུགས་པ །_
en: They are immersed in the accomplishment of beings’ discipline, absorption, and liberation.

source: སེམས་ཅན་ རྣམས་ ཀྱི་ རྣམ་པར་ གྲོལ་བ འི་ ཡེ་ཤེས་ མཐོང་བ་ སྒྲུབ་པ་ ལ་ མངོན་དུ་ ཞུགས་པ །_
en: They are immersed in the accomplishment of the liberated wisdom vision of beings.

source: སེམས་ཅན་ རྣམས་ ཀྱི་ ཞི་གནས་ སྒྲུབ་པ་ ལ་ མངོན་དུ་ ཞུགས་པ །_ སེམས་ཅན་ རྣམས་ ཀྱི་ ལྷག་མཐོང་ སྒྲུབ་པ་ ལ་ མངོན་དུ་ ཞུགས་པ །_
en: They are immersed in the accomplishment of beings’ tranquility and special insight.

source: སེམས་ཅན་ རྣམས་ ཀྱི་ ལམ་ མངོན་པར་ སྒྲུབ་པ་ ལ་ མངོན་དུ་ ཞུགས་པ །_ སེམས་ཅན་ རྣམས་ ཀྱི་ འབྲས་བུ་ མངོན་པར་ སྒྲུབ་པ་ ལ་ མངོན་དུ་ ཞུགས་པ །_ སེམས་ཅན་ རྣམས་ ཀྱི་ བདེན་ [133b] པ་ མངོན་པར་ སྒྲུབ་པ་ ལ་ མངོན་དུ་ ཞུགས་པ་ ཡིན །_
en: They are immersed in the accomplishment of beings’ path, fruition, and truth. [133.b]

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ འདྲ་བ འི་ སྐྱེས་བུ་ དམ་པ་ དེ་དག་ ནི་ ཕྱོགས་ བཅུ འི་ ངེས་པ འི་ ཚིག་ གིས་ བརྡ་ རབ་ཏུ་ ཤེས་པ །_ ཐ་སྙད་ ཀྱིས་ བརྡ་ རབ་ཏུ་ ཤེས་པ །_ ཆོས་ ཐམས་ཅད་ ལ་ ཡང་ མངོན་པར་ ཞེན་པ་ མེད་པ འི་ ཡེ་ཤེས་ ཀྱི་ གནས་ རྗེས་སུ་ ཐོབ་པ །_ ཆོས་ ཐམས་ཅད་ ལ་ ཡང་ ཕན་པ འི་ ཡེ་ཤེས་ སྒྲུབ་པ་ ལ་ མངོན་དུ་ ཞུགས་པ །_ ཆོས་ ཐམས་ཅད་ སྟོང་པ འི་ ཡེ་ཤེས་ སྒྲུབ་པ་ ལ་ མངོན་དུ་ ཞུགས་པ་ ཡིན་པ འི་ ཕྱིར་ རོ །_།
en: $1105 “The reason for this, Śāradvatī­putra, is that such sublime beings as these, who understand signs according to the languages and conventions prevalent throughout the ten directions, have attained the state of wisdom unhindered with regard to any phenomena, are immersed in accomplishing the wisdom that masters all phenomena, and are immersed in accomplishing the wisdom in which all phenomena are empty.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ མདོར་ན་ སྐྱེས་བུ་ དམ་པ་ དེ་དག་ ནི་ ཡེ་ཤེས་ དེ་ལྟ་ བུ་ ལ་ མངོན་དུ་ ཞུགས་པ །_ ཡེ་ཤེས་ དེ་ལྟ་ བུ་ ལ་ ལྷག་པ ར་ དམིགས་པ །_ ཡེ་ཤེས་ དེ་ལྟ་ བུ་ ལ་ སྨོན་ལམ་ འདེབས་པ །_ ཡེ་ཤེས་ དེ་ལྟ་ བུ་ ལ་ ཀུན་ དུ་ སྒོམ་པ་ ཡིན །_
en: $1106 “Śāradvatī­putra, in sum, these sublime beings are immersed in, adhere to, aspire for, and constantly cultivate such a wisdom.

source: སྐྱེས་བུ་ དམ་པ་ དེ་དག་ ནི་ གོ་ཆ་ དང་ སྤྱོད་པ འི་ ཡོན་ཏན་ དེ་ལྟ་ བུ་ ལ་ རབ་ཏུ་ གནས་པ་ ཡིན །_
en: These sublime beings are committed to such qualities of armor-like diligence#50 and conduct.

source: དེ་དག་ ནི་ ལམ་ དེ་ དང་ ཡང་ ལྡན་པ་ ཡིན་པ འི་ ཕྱིར་ ཏེ །_
en: Since they are following such a path,

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ངས་ དཔེ་ དེ་ཡང་ ཅུང་ཟད་ དང་ །_ ངན་ངོན་ དང་ །_ གསོག་ ཚིག་ བསྟན་པ་ ཡིན་ ནོ །_།
en: Śāradvatī­putra, the analogies I have explained illustrate how minor, meager, and trifling others are by comparison.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གཞན་ ཡང་ སྐྱེས་བུ་ དམ་པ་ དེ་དག་ ནི་ གོ་ཆ་ དེ་ བྱས་པ་ ལ་ དཔེ་ དེ་ལྟ་ བུར་ སོ་སོ ར་ འོས་པ་ ཡིན་ ཏེ །_
en: $1107 “Moreover, Śāradvatī­putra, for those sublime beings who have enacted that armor-like diligence, such analogies are individually suited,

source: དེ་བཞིན་ གཤེགས་པ ས་ ཇི་ལྟ ར་ རབ་ཏུ་ མཁྱེན་པ་ བཞིན་ ནོ །_།
en: as these are precisely according to how the Thus-Gone One understands it.

source: གང་དེ་ བཞིན་ གཤེགས་པ་ ཇི་ འདྲ་བ་ དང་ ལྡན་པ འི་ ཡེ་ཤེས་ དེ་ལྟ་ བུ་ དང་ ལྡན་པ་ དེས་ དཔེ་ དེ་ སོ་སོ ར་ ཤེས་པ ར་ བྱ །_ |#| ཁོང་ དུ་ ཆུད་པ ར་ བྱ འོ །_།
en: Those who possess such a wisdom, which is precisely the one possessed by a thus-gone one, should learn and comprehend each of those analogies.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གནས་ དེ་ ལ་ ཉན་ཐོས་ རྣམས་ ཀྱིས་ ནི་ དད་པས་ འགྲོ་བ ར་ བྱ་ སྟེ །_ |#| ཇི་ལྟ་བ་ བཞིན་ དུ་ ཁོང་ དུ་ མི་ ཆུད་ དོ །_།
en: Śāradvatī­putra, hearers should approach that state through faith, |#| for they will not comprehend it exactly as it is.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གཞན་ ཡང་ ཁྱོད་ ཀྱིས་ སེམས་ཅན་ དེ་ལྟ་ བུ་ དག་ གི་ དོན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ ལ་ དྲིས་ ཏེ །_
en: $1108 “Moreover, Śāradvatī­putra, you have posed questions to the Thus-Gone One on behalf of such beings. |#| And yet,

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཁྱོད་ ལ་ འཇུག་པ་ ཙམ་ དང་ །_ ཅུང་ཟད་ ཙམ་ དང་ །_ དཔེ་ཙམ་ དང་ །_ གསོག་ ཙམ་ དང་ །_ གྲངས་ ཙམ་ འགའ་ཞིག་ བྱ འོ །_།
en: Śāradvatī­putra, I will provide you with only a mere introduction, a mere smidgen, a mere illustration, a mere trifling, and a mere approximation.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ ནི་ ཉི་མ འི་ ལས་མ་ ཡིན །_ |#| ཟླ་བ་ ཕྱེད་ ཀྱི་ ལས་མ་ ཡིན །_ |#| ཟླ་བ འི་ ལས་མ་ ཡིན །_ |#| ལོ འི་ ལས་མ་ ཡིན །_ |#| ལོ་ བརྒྱ འི་ ལས་མ་ ཡིན །_ |#| ལོ་ སྟོང་ གི་ ལས་མ་ ཡིན །_ |#| ལོ་ འབུམ་ གྱི་ ལས་མ་ ཡིན །_ |#| བསྐལ་པ འི་ ལས་མ་ ཡིན །_ |#| བསྐལ་པ་ བརྒྱ འི་ ལས་མ་ ཡིན །_ |#| བསྐལ་པ་ སྟོང་ གི་ ལས་མ་ ཡིན །_ |#| བསྐལ་པ་ འབུམ་ གྱི་ ལས་མ་ ཡིན་པ འི་ ཕྱིར་ ཏེ །_
en: This is because, Śāradvatī­putra, understanding such things does not entail a day’s activity, a fortnight’s activity, a month’s activity, a year’s activity, a hundred years’ activity, a thousand years’ activity, a hundred thousand years’ activity, an eon’s activity, a hundred eons’ activity, a thousand eons’ activity, or a hundred thousand eons’ activity. [134.a]

source: ཤ་ར་དྭ་ཏི འི་ བུ་ [134a] འོན་ཀྱང་ དེ་ ནི་ བསྐལ་པ་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ འི་ ལས་ ཡིན་ ནོ །_།
en: Rather, Śāradvatī­putra, it is the activity of immeasurably many, countless eons.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ རེ་ཞིག་ སེམས་ དང་པོ་ བསྐྱེད་པ འི་ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ གང་ཡིན་པ་ དེ་ཉིད་ ཀྱི་ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ ངན་ངོན་ ཙམ་ དང་ །_ གསོག་ ཙམ་ དང་ །_ ཅུང་ཟད་ ཙམ་ གྱི་ ཡོན་ཏན་ དེ་དག་ ཀྱང་ རེ་ ཞིག་ བསྐལ་པ་ བརྒྱ་ དང་ །_ བསྐལ་པ་ སྟོང་ དང་ །_ བསྐལ་པ་ འབུམ་ གྱིས་ ཀྱང་ བགྲོད་པ ར་ མི་ ནུས་ ན
en: If, Śāradvatī­putra, one cannot cover in one hundred eons, one thousand eons, or one hundred thousand eons even the qualities of the meager, trifling, and miniscule heap of merit that constitutes the very heap of merit from first giving rise to the mind of awakening, then

source: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རྣམས་ ཀྱི་ སེམས་བསྐྱེད་པ འི་ ཚད་ ཤེས་པ ར་ འགྱུར་བ་ ལྟ་ཅི་ སྨོས་ ཏེ་ དེ་ ནི་ གནས་ མེད་ དོ །_།
en: there is no need even to discuss whether one could understand the extent of the mind of awakening engendered by bodhisattva great beings—it is impossible.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ སྤྱོད་པ་ ནི་ ཡེ་ཤེས་ ཆེན་པོ་ དོན་ དུ་ གཉེར་བ་ ཉིད་ ཀྱི་ ཕྱིར་ ཚོགས་ དཔག་ ཏུ་ མེད་པ འོ །_།
en: $1109 “Śāradvatī­putra, the conduct of bodhisattvas involves an immeasurable collection of merit, since it is for the purpose of great wisdom.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ སྤྱོད་པ་ ནི་ སེམས་ཅན་ གྲངས་མེད་པ་ ཡོངས་སུ་ སྨིན་པ ར་ འགྱུར་བ ས་ ཟད་ མི་ ཤེས་པ འོ །_།
en: Śāradvatī­putra, the conduct of bodhisattvas knows no end, since it matures innumerable beings.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ སྤྱོད་པ་ ནི་ ཆོས་ ཟབ་མོ་ མངོན་པར་ རྫོགས་པ ར་ བྱང་ཆུབ་པ་ ཉིད་ ཀྱི་ ཕྱིར་ ཁོང་ དུ་ ཆུད་པ ར་ དཀའ་བ འོ །_།
en: Śāradvatī­putra, the conduct of bodhisattvas is difficult to comprehend, since it is the very comprehension of the profound Dharma.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ སྤྱོད་པ་ ནི་ ཆོས་ ཐམས་ཅད་ ལ་ རྟེན་པ་ མེད་པ་ ཉིད་ ཀྱི་ ཕྱིར་ ཟབ་པ འོ །_།
en: Śāradvatī­putra, the conduct of bodhisattvas is profound, since it is the very absence of foundation in all phenomena.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ སྤྱོད་པ་ ནི་ སངས་ རྒྱས་ ཀྱི་ ཡེ་ཤེས་ མཐའ་ཡས་པ་ ཉིད་ ཀྱི་ ཕྱིར་ མཐའ་ ཡ ས་ མུ་མེད་པ འོ །_།
en: Śāradvatī­putra, the conduct of bodhisattvas is free of limit or boundary, since it is itself the infinite buddha wisdom.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ སྤྱོད་པ་ ནི་ ཚད་ མེད་པ འི་ ཕྱིར་ ལས་ མཐར་ཐུག་པ་ མེད་པ འོ །_།
en: Śāradvatī­putra, the conduct of bodhisattvas has no culmination, since it is immeasurable.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ སེམས་ཅན་ དེ་ཙམ་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདའ་བ ར་ བྱ །_ |#| སྦྱིན་པ་ དེ་ཙམ་ སྦྱིན་པ ར་ བྱ །_ |#| ཚུལ་ཁྲིམས་ དེ་ཙམ་ དང་ །_ བཟོད་པ་ དེ་ཙམ་ དང་ །_ བརྩོན་འགྲུས་ དེ་ཙམ་ དང་ །_ བསམ་གཏན་ དེ་ཙམ་ དང་ །_ ཤེས་རབ་ དེ་ཙམ་ བསྒོམ་པ ར་ བྱ །_ |#| དུས་ དེ་ཙམ་ གྱིས་ འདི་ ཕན་ཆད་ བསྒོམ་པ ར་ བྱ །_ |#| འདི་ ཕན་ཆད་ བསྒོམ་པ ར་ མི་ བྱ འོ་ སྙམ་ མོད་ ཀྱི་
en: $1110 “Śāradvatī­putra, one may think, ‘I will bring this many beings to nirvāṇa. |#| I will practice this much generosity. |#| I will cultivate this much discipline, this much patience, this much diligence, this much concentration, and this much insight. |#| I will cultivate these for a certain period of time, but then at some point later on I will not cultivate them further.’

source: འོན་ཀྱང་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ སྤྱོད་པ་ ནི་ མཐར་ཐུག་པ་ མེད་པ་ ཁོ་ན འོ །_།
en: And yet, Śāradvatī­putra, the conduct of bodhisattvas is entirely free of culmination.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱིས་ ནི་ འདི་ལྟ་སྟེ །_ |#| བྱང་ཆུབ་ ཀྱི་ སྙིང་པོ འི་ མཐར་ཐུག་པ་ གཅིག་པུ་ ཁོ་ན་ མཐོང་ སྟེ །_
en: Śāradvatī­putra, this is because bodhisattvas only see the sole culmination of the heart of awakening, such that,

source: དེ་ ལ་ ཆོས་ ཐམས་ཅད་ ཤིན་ཏུ་ བྱང་བ་ དྲི་མ་ མེད་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ཐོབ་ ནས །_
en: having attained the absorption called stainless utter purity of all phenomena ,

source: ཆོས་ ཐམས་ཅད་ མངོན་པར་ རྫོགས་ [134b] པར་བྱང་ ཆུབ་པ འི་ ཕྱིར་ རོ །_།
en: they fully realize all phenomena. [134.b]

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རྣམས་ ཀྱི་ ལྷག་པ འི་ བསམ་པ་ ནི་ གནས་ གསུམ་ དུ་ བལྟ་བ ར་ བྱ་ སྟེ །_
en: $1111 “Śāradvatī­putra, the exalted intention of bodhisattva great beings should be regarded in terms of three points:

source: ལྷག་པ འི་ བསམ་པ་ དང་པོ་ དེ་ ནི་ དངོས་པོ་ ཐམས་ཅད་ ཡོངས་སུ་ གཏོང་བ འི་ ལས་ ཉིད་ དུ་ ཤེས་པ ར་ བྱ འོ །_།
en: The first exalted intention should be understood as the very action of renouncing all things.

source: བྱང་ཆུབ་ སེམས་ དཔ འི་ ལྷག་པ འི་ བསམ་པ་ གཉིས་པ་ དེ་ ནི་ ཆོས་ ཡོངས་སུ་ ཚོལ་བ་ དང་ །_ ཆོས་ ལེན་པ་ དང་ །_ ཆོས་ ཀུན་ དུ་ འཛིན་པ ར་ ནི་ བྱེད་ ལ །_ བདག་ ཏུ་ ལྷག་པ ར་ ཞེན་པ་ ནི་ མེད་པ་ ཉིད་ དུ་ ཤེས་པ ར་ བྱ འོ །_།
en: The second exalted intention of a bodhisattva should be understood as the very non-existence of any special clinging to self, even while pursuing the Dharma, receiving the Dharma, and fully upholding the Dharma.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ལྷག་པ འི་ བསམ་པ་ གསུམ་པ་ དེ་ ནི་ ཆོས་ ཟབ་མོ་ མི་ སྤོང་བ་ དང་ །_ སངས་ རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ བྱང་ཆུབ་ ལ་ འཇུག་པ་ ཉིད་ དུ་ མོས་ ཤིང་ སྒྱིད་ལུག་པ་ མེད་པ་ སྟེ །_
en: The third exalted intention, Śāradvatī­putra, is not discarding the profound Dharma and being keenly interested, without discouragement, in partaking in the awakening of all blessed buddhas.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ བྱང་ཆུབ་ སེམས་དཔ འི་ ལྷག་པ འི་ བསམ་པ་ ནི་ གནས་ གསུམ་པོ་ དེ་དག་ ཏུ་ རིག་པ ར་ བྱ འོ །_།
en: Śāradvatī­putra, the exalted intention of a bodhisattva should be regarded in terms of those three points.

source: ཤ་ར་དྭ་ཏི འི་ བུ །_ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རྣམས་ ཀྱི་ ལྷག་པ འི་ བསམ་པ་ ནི་ གནས་ གཞན་ གསུམ་ དུ་ བལྟ་བ ར་ བྱ་ སྟེ །_
en: $1112 “Śāradvatī­putra, the exalted intention of bodhisattva great beings should also be regarded in terms of three other points.

source: གསུམ་ གང་ཞེ་ན །_
en: What are these three points?

source: བྱང་ཆུབ་ སེམས་དཔ འི་ སྡེ་སྣོད་ ཀྱི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདོད་པ འི་ ཕྱིར །_ ཆོས་ ཡོངས་སུ་ ཚོལ་བ་ ལ་ རྟག་ ཏུ་ བརྩོན་འགྲུས་ བརྩམས་པ་ ཉིད་ དང་ །_
en: The constant application of diligence in pursuit of the Dharma out of a desire for the Dharma discourses of the Bodhisattva Collection;

source: བདག་ཉིད་ ཀྱི་ དགེ་བ འི་ རྩ་བ་ སྦྱང་བ ར་ བྱ་བ འི་ ཕྱིར་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ དགེ་བ འི་ རྩ་བ་ སྦྱང་བ ར་ བྱ་བ འི་ ཕྱིར །_ ཆོས་ སྨྲ་བ འི་ རྗེས་སུ་ འབྲང་བ་ ཉིད་ དང་ །_
en: following Dharma teachers in order to refine their own and all beings’ roots of virtue; |#| and

source: དེ་ ལ་ ཡང་ ཉེ་བ ར་ སྤྱོད་པ་ བླ་ ན་ |#| མེད་པ་ སྟོན་པ་ ཉིད་ ཀྱིས་ ཡང་ དང་ ཡང་ དུ་ ཉེ་བ ར་ སྤྱོད་པ་ སྟོན་པ་ ཉིད་ དང་ །_ |#| དེ་ ལ་ ཡང་ བསྙེན་པ ར་ དཀའ་བ་ མཐོང་བ་ ན་ བདག་ གིས་ ལས་ ལ་ སྟོན་པ་ ཉིད་ ཀྱིས་ གང་ གི་ ཕྱིར་ བདག་ གིས་ མ་ ཐོས་པ་ ནི་ བདག་ཉིད་ ཀྱི་ ལས་ དེ་ ཡིན་ གྱི །_ འདི འི་ ལེ་ལན་ ནི་ མ་ཡིན་པ ས་ དེ འི་ ཕྱིར་ ཅི་ ནས་ བདག་ གིས་ འདི་ ལ་ཉེ་ བར་ སྤྱད་པ ས་ ལས་ ཀྱི་ སྒྲིབ་པ་ ཐམས་ཅད་ བྱང་བ ར་ འགྱུར་བ་ དང་ །_ ཡང་དག་ པར་ རྒྱུན་ ཆད་པ ར་ འགྱུར་བ་ དེ་ལྟ ར་ བྱ འོ་ སྙམ་པ་ འདི་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ལྷག་པ འི་ བསམ་པ་ གསུམ་པ འོ །_།
en: the third exalted intention of bodhisattvas, which is the repeated demonstration of service by presenting unexcelled service to such teachers. |#| In this regard, when seeing that such service can be difficult, one should think, ‘This is a demonstration of my karma. |#| Therefore, my not having heard is my own karma and there is no one to blame. |#| Thus, I must by all means purify and sever all my karmic obscurations through service.’

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ལྟ་བས་ན་ རྣམ་ གྲངས་ དེས་ན་ |#| ཁྱོད་ ཀྱིས་ ཅི་ ནས་ ཆོས་ ཡོངས་སུ་ ཚོལ་བ་ ལ་ མངོན་པར་ བརྩོན་ ཞིང་ ཆོས་ སྨྲ་བ འི་ རྗེས་སུ་ འབྲང་བ ས་ སངས་རྒྱས་ ཀྱི་ ཆོས་ ཐམས་ཅད་ ཡོངས་སུ་ རྫོགས་པ ར་ འགྱུར་ [135a] བ་ དེ་ལྟ ར་ བལྟ་བ ར་ བྱ འོ །_།
en: Śāradvatī­putra, you should therefore regard this explanation to mean that the perfection of all buddha qualities is brought about through striving by all means to pursue the Dharma, and following Dharma teachers. [135.a]

source: ཤ་ར་དྭ་ཏི འི་ བུ་ སྔོན་བྱུང་བ་ འདས་པ འི་ དུས་ ན་ བསྐལ་པ་ ཡངས་པ་ ཚད་ མེད་པ །_ བསམ་ གྱིས་ མི་ ཁྱབ་པ །_ གྲངས་མེད་ པར་ གྱུར་པ་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ ཡེ་ཤེས་ མཆོག་ ཅེས་བྱ་བ འི་ བསྐལ་པ་ ལ་ རིག་པ་ དང་ ཞབས་ སུ་ ལྡན་པ །_ བདེ་བ ར་ གཤེགས་པ །_ འཇིག་རྟེན་ མཁྱེན་པ །_ སྐྱེས་བུ་ འདུལ་བ འི་ ཁ་ལོ་ སྒྱུར་བ །_ བླ་ ན་ |#| མེད་པ །_ ལྷ་ དང་ མི་ རྣམས་ ཀྱི་ སྟོན་པ །_ དེ་བཞིན་ གཤེགས་པ་ ཀུན་ ཏུ་ སྲུང་བ འི་ བདག་པོ་ སྤྲིན་ གྱི་ དབང་ཕྱུག་ མར་མེ་ ཞེས་ བྱ་བ་ འཇིག་རྟེན་ དུ་ བྱུང་ ངོ་ །_།
en: $1113 “Śāradvatī­putra, long ago, immeasurably vast and countless beyond countless eons ago, in the eon called Jñānottama , there appeared in the world a thus-gone one, a worthy one, a perfect buddha, someone wise and virtuous, a blissful one, a knower of the world, a steersman taming beings, an unsurpassable one, a teacher of gods and humans, a blessed buddha by the name of Ārakṣapati Megheśvaradīpa.
